{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape": null, "input_dtype": "float32", "function_type": "lambda", "name": "lambda_5", "batch_input_shape": [null, 16, 32, 3], "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faFC:/navneet/Udacity/SDC/Term1/CarND-Transfer-Learning-Lab/Model_029a.py\u00da\b<lambda>\u00c7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_21", "W_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "same", "nb_filter": 24, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_22", "W_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "same", "nb_filter": 36, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_23", "W_constraint": null, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "same", "nb_filter": 48, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_31", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_24", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "same", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_32", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_25", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "b_constraint": null, "border_mode": "same", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "dense_17", "W_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": 512, "output_dim": 100, "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_33", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "dense_18", "W_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": 100, "output_dim": 50, "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_34", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "dense_19", "W_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": 50, "output_dim": 10, "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "name": "dense_20", "W_constraint": null, "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": 10, "output_dim": 1, "b_regularizer": null, "bias": true}}]}