{"config": [{"config": {"output_shape": null, "name": "lambda_2", "batch_input_shape": [null, 16, 32, 3], "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faEC:/navneet/Udacity/SDC/Term1/CarND-Transfer-Learning-Lab/Model_017.py\u00da\b<lambda>z\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 5, "bias": true, "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "convolution2d_6", "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_filter": 24, "subsample": [2, 2], "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 5, "bias": true, "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "convolution2d_7", "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_filter": 36, "subsample": [2, 2], "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 5, "bias": true, "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "convolution2d_8", "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_filter": 48, "subsample": [2, 2], "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "convolution2d_9", "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "bias": true, "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "convolution2d_10", "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"input_dim": 512, "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "dense_5", "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 100, "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "dense_6", "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": 50, "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "dense_7", "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 10, "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "name": "dense_8", "b_regularizer": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}