{"config": [{"config": {"filters": 16, "padding": "same", "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_1", "activation": "relu", "strides": [2, 2], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "batch_input_shape": [null, 224, 224, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [3, 3], "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"filters": 32, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_2", "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [3, 3], "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"filters": 64, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_3", "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow"}